dataset_gen/CE-RP_openfoam_irregular/Design_Point_0/system/setFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
defaultFieldValues
(
    volVectorFieldValue U (0 0 0)
    volScalarFieldValue p 1
    volScalarFieldValue T 1
);

regions
(

    boxToCell
    {
        type    boxToCell;
        box     (0 0 0) (0.5 0.5 0.5);
        fieldValues
        (
            volVectorFieldValue U (-0.5631730470539837 0.7250069040713292 0)
            volScalarFieldValue p 0.43749343162038534
            volScalarFieldValue T 0.0015546571946186273
        );
    }

    boxToCell
    {
        type    boxToCell;
        box     (0.5 0 0) (1.0 0.5 0.5);
        fieldValues
        (
            volVectorFieldValue U (0.5929798663989616 -0.8317036944582052 0)
            volScalarFieldValue p 0.3250674284851477
            volScalarFieldValue T 0.0028116102232431284
        );
    }

    boxToCell
    {
        type    boxToCell;
        box     (0 0.5 0) (0.5 1.0 0.5);
        fieldValues
        (
            volVectorFieldValue U (0.10931416167730834 0.34012458820944724 0)
            volScalarFieldValue p 0.5927639685708649
            volScalarFieldValue T 0.003315740717171874
        );
    }

    boxToCell
    {
        type    boxToCell;
        box     (0.5 0.5 0) (1.0 1.0 0.5);
        fieldValues
        (
            volVectorFieldValue U (-0.3666221240990153 -0.7863589101405104 0)
            volScalarFieldValue p 0.9319798813316194
            volScalarFieldValue T 0.004059709600579722
        );
    }
);

